### 21.06.01 서현진 한경아카데미

In [1]:
import pandas as pd
import numpy as np

## 1. 연습 문제 4.1.1

(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.

(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.

In [7]:
s1 = pd.Series({"스마트폰": 120, "스마트와치": 30 , "노트북": 250,"패드": 125},
               index=["스마트폰","스마트와치","노트북","패드"])
s1

스마트폰     120
스마트와치     30
노트북      250
패드       125
dtype: int64

In [8]:
s2 = pd.Series({"스마트폰": 50, "스마트와치": 5 , "선풍기": 2,"보조베터리": 3},
               index=["스마트폰","스마트와치","선풍기","보조베터리"])
s2

스마트폰     50
스마트와치     5
선풍기       2
보조베터리     3
dtype: int64

In [12]:
s1 + s2

노트북        NaN
보조베터리      NaN
선풍기        NaN
스마트와치     35.0
스마트폰     170.0
패드         NaN
dtype: float64

In [13]:
s1 - s2

노트북       NaN
보조베터리     NaN
선풍기       NaN
스마트와치    25.0
스마트폰     70.0
패드        NaN
dtype: float64

In [14]:
s1 * s2

노트북         NaN
보조베터리       NaN
선풍기         NaN
스마트와치     150.0
스마트폰     6000.0
패드          NaN
dtype: float64

In [10]:
s1 / s2

노트북      NaN
보조베터리    NaN
선풍기      NaN
스마트와치    6.0
스마트폰     2.4
패드       NaN
dtype: float64

## 연습 문제 4.1.2

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

(1) 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.

(2) 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [18]:
data = {
    "2019": [9904312, 3448737, 2890451, 2466052, 505055],
    "2020": [9631482, 3393191, 2632035, 2431774, 123456],
    "2021": [9762546, 3512547, 2517680, 2456016, 304568],
    "2018": [9853972, 3655437, 2466338, 2473990, 256478],
    "지역": ["수도권", "경상권", "수도권", "경상권",'수도권'],
    "2018-2021 증가율": [0.0583, 0.0463, 0.0382, 0.0641, 0.048]
}
columns = ["지역", "2018", "2019", "2020", "2021", "2018-2021 증가율"]
index = ["서울", "부산", "인천", "대구",'안산']
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2018     2019     2020     2021  2018-2021 증가율
서울  수도권  9853972  9904312  9631482  9762546         0.0583
부산  경상권  3655437  3448737  3393191  3512547         0.0463
인천  수도권  2466338  2890451  2632035  2517680         0.0382
대구  경상권  2473990  2466052  2431774  2456016         0.0641
안산  수도권   256478   505055   123456   304568         0.0480

## 연습 문제 4.1.3

다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

data = {
    "국어": \[80, 90, 70, 30],
    "영어": \[90, 70, 60, 40],
    "수학": \[90, 60, 80, 70],
}

columns = \["국어", "영어", "수학"]

index = \["춘향", "몽룡", "향단", "방자"]

df = pd.DataFrame(data, index=index, columns=columns)


(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.

(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.

(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.

(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.

(5) 춘향의 점수를 데이터프레임으로 나타낸다.

(6) 향단의 점수를 시리즈로 나타낸다.

In [20]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [21]:
# (1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [26]:
# (2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [43]:
# (3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['평균점수'] = round(df.mean(axis=1), 3)
df

    국어  영어  수학    평균점수
춘향  80  90  90  86.667
몽룡  90  70  60  73.333
향단  70  60  80  70.000
방자  30  80  70  59.987

In [44]:
# (4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df.iloc[3,1] = 80
df['평균점수'] = round(df.mean(axis=1), 3)
df

    국어  영어  수학    평균점수
춘향  80  90  90  86.667
몽룡  90  70  60  73.333
향단  70  60  80  70.000
방자  30  80  70  59.997

In [45]:
# (5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.loc[['춘향']]

    국어  영어  수학    평균점수
춘향  80  90  90  86.667

In [46]:
#(6) 향단의 점수를 시리즈로 나타낸다.
df.loc['향단']

국어      70.0
영어      60.0
수학      80.0
평균점수    70.0
Name: 향단, dtype: float64

## 연습 문제 4.3.1

모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.

10가지 이상의 방법으로 특정한 행과 열을 선택한다.

In [47]:
df = pd.DataFrame(np.arange(10, 35).reshape(5, 5),
                  index=["a", "b", "c",'d','e'],
                  columns=["A", "B", "C", "D",'E'])
df

    A   B   C   D   E
a  10  11  12  13  14
b  15  16  17  18  19
c  20  21  22  23  24
d  25  26  27  28  29
e  30  31  32  33  34

In [50]:
#1)
df.iloc[1,2]

17

In [53]:
#2)
df.iloc[1:2, 2:3]

    C
b  17

In [57]:
#3)
df.iloc[-4,-3]

17

In [58]:
#4)
df.loc['b','C']

17

In [59]:
#5)
df.loc['b']['C']

17

In [79]:
#6)
df.loc[  df.C == 17 , ['C'] ]

    C
b  17

In [86]:
#7)
df.loc[["b"], ["C"]]

    C
b  17

In [88]:
#8)
df.C[1]

17

In [89]:
#9)
df.C.b

17

In [91]:
#10)
df['C'][1]

17

In [94]:
#11)
df['C']['b']

17

## 연습 문제 4.4.1

타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.

In [57]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [58]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

## 연습 문제 4.4.2

sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.

In [102]:
type(titanic)

pandas.core.frame.DataFrame

In [106]:
# 타이타닉호 승객에 대해 성별(sex) 인원수
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [107]:
#나이별(age) 인원수
titanic['age'].value_counts()

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
55.50     1
74.00     1
0.92      1
70.50     1
12.00     1
Name: age, Length: 88, dtype: int64

In [108]:
#선실별(class) 인원수
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [153]:
# 사망/생존(alive) 인원수
titanic.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

## 연습 문제 4.4.3

타이타닉호 승객의 평균 나이를 구하라.

타이타닉호 승객중 여성 승객의 평균 나이를 구하라.

타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.

In [154]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
#타이타닉호 승객의 평균 나이
titanic['age'].mean()

29.69911764705882

In [156]:
#타이타닉호 승객중 여성 승객의 평균 나이
titanic[titanic['sex'] == 'female']['age'].mean()

27.915708812260537

In [157]:
#타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이
titanic[titanic['sex'] == 'female'][titanic['pclass'] == 1]['age'].mean()

<ipython-input-157-9b1f0f4e81b1>:2: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  titanic[titanic['sex'] == 'female'][titanic['pclass'] == 1]['age'].mean()

34.61176470588235

## 연습 문제 4.4.4

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.

20살이 넘으면 성별을 그대로 사용한다.

20살 미만이면 성별에 관계없이 “child”라고 한다.

In [55]:
titanic['category1'] = titanic.apply(lambda r : r.sex if r.age >= 20 else 'child', axis =1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male

## 연습 문제 4.4.5

타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.

In [32]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [33]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
category1      891
dtype: int64

In [94]:
titanic.apply(pd.value_counts)['age']

0          NaN
0.42       1.0
0.67       1.0
0.75       2.0
0.83       2.0
          ...
malenan    NaN
man        NaN
no         NaN
woman      NaN
yes        NaN
Name: age, Length: 476, dtype: float64

In [96]:
titanic['age'] = titanic['age'].fillna(titanic['age'].mean()).astype(int)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category2
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male27.0
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,female19.0
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,femalenan
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male26.0
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male32.0

## 연습 문제 4.4.6

타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.

성별을 나타내는 문자열 male 또는 female로 시작한다.

성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.

예를 들어 27살 남성은 male27 값이 된다.

In [97]:
titanic['category2'] = titanic.apply(lambda r : f'{r.sex}{r.age}', axis =1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category2
886,0,2,male,27,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,male27
887,1,1,female,19,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,female19
888,0,3,female,29,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,female29
889,1,1,male,26,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,male26
890,0,3,male,32,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,male32

In [ ]:
## 연습 문제 4.4.7

타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.

In [ ]:
https://datascienceschool.net/01%20python/04.04%20%EB%8D%B0%EC%9D%B4%ED%84%B0%ED%94%84%EB%A0%88%EC%9E%84%EC%9D%98%20%EB%8D%B0%EC%9D%B4%ED%84%B0%20%EC%A1%B0%EC%9E%91.html